using System;
using System.Collections.Generic;
using System.Text;

namespace Lab8
{
    class Вертолет : ТехСредство
    {
        public Вертолет()
            :base()
        {
            ТипТранспорта = Транспорт.Воздушный;
            ВидТранспорта = Виды.Универсальный;
            СтруктураТранспорта = Структура.Немагистральный;

        }
        public Вертолет(string СП, string П, string М, Транспорт ТР, Виды В, Структура СТР)
            : base(СП, П, М)
        {
            ТипТранспорта = ТР;
            ВидТранспорта = В;
            СтруктураТранспорта = СТР;
        }
        public Транспорт ТипТранспорта;
        public Виды ВидТранспорта;
        public Структура СтруктураТранспорта;

        public override string ХарактеристикаТехСредства
        {
            get
            {
                return ТипТранспорта.ToString() + ", " + ВидТранспорта.ToString() + ", " + СтруктураТранспорта.ToString() + ", " + base.ХарактеристикаТехСредства;
            }
        }

    }
}
